'use strict';

//    === це оператор строгої рівності, не перетворює типи операндів
//    == оператор рівості, що перетворює типи операндів\
//    !== оператор строгої нерівності

//    || логічний оператор (or) повертає перший true операнд (якщо такого немає - то останній)
// || повертає перше істинне значення.
// ?? повертає перше визначене значення.
//    && логічний оператор (and) повертає перший false операнд (якщо такого немає - то останній)
//    Пріоритет НЕ ! є найвищим серед усіх логічних операторів, тому він завжди виконується першим, перед && або ||.

alert('This is a work of art');
// yeah right yeah right